Тестовая_база_ERP_14/src/InformationRegisters/СтавкиНалогаНаПрибыльДляВсехОрганизаций/СтавкиНалогаНаПрибыльДляВсехОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНалогаНаПрибыльДляВсехОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаФБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаСубъектРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/СтавкиНалогаНаПрибыльДляВсехОрганизаций/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьСтавкиПоУмолчанию();
	КонецЕсли;
	УправлениеФормой(ЭтаФорма);
	
	ВыводитсяПредупреждение = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьСтавкиПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкиПоУмолчанию()
	
	Если ЗначениеЗаполнено(Запись.Период) Тогда
		Период = Запись.Период;
	Иначе
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запись.СтавкаФБ = РегистрыСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций.ЗначениеПоУмолчаниюФедеральныйБюджет(Период);
	Запись.СтавкаСубъектРФ = РегистрыСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций.ЗначениеПоУмолчаниюРегиональныйБюджет(Период);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Форма.ПрименятьОднуСтавку = НЕ ПолучитьФункциональнуюОпцию("ПрименяютсяРазныеСтавкиНалогаНаПрибыль");
	Форма.Элементы.СтавкаСубъектРФ.Видимость = Форма.ПрименятьОднуСтавку;

КонецПроцедуры

#КонецОбласти
